_Расскажите?
foldl и foldr позволяют пройтись по списку и вычислить для него некоторое значение.
_Отличие?
Отличие между ними в том, что foldl обрабатывает значения списка слева направо, 
а foldr - справа налево.
При этом, foldl порождает итерационный процесс, а foldr - рекурсивный, 
из-за чего использование foldl предпочтительно в тех ситуациях, 
когда порядок вычисления не важен.
_Всегда ли стоит переписывать foldr на foldl? 
Кажется, что да, ведь, если нам важно обходить список с определенного конца, 
его всегда можно развернуть при помощи итерационной функции reverse.

(foldl 
  (lambda (cur prev) 
    (if (and (< cur lstMax) (or (equal? prev '()) (> cur prev)))
      cur
      prev
    )
  )
  '()
  lst
)

_Что такое синтаксический сахар
Это конструкции языка, которые могут быть заменены другими конструкциями этого языка, 
но позволяют уменьшить количество кода или сделать его более читаемым
_Пример
(define (fun x) body) == (define fun (lambda (x) body))
